const randomComplexCharacters = ['馔', '醍', '豁', '甏', '骡', '辉', '潮', '缧', '嚎', '綦', '滴', '髋', '飑', '嬷', '鼋', '踯', '擤', '煊', '镧', '奠', '鹭', '嗝', '嬉', '觥', '鲲', '谪', '滁', '紫', '嗑', '豌', '菱', '摘', '绫', '蕞', '喧', '澜', '镯', '演', '隔', '夤', '瘰', '臜', '鲣', '擎', '嗉', '僖', '躅', '慝', '翮', '崚', '摒', '遒', '熹', '港', '摞', '耤', '谰', '壕', '嘲', '酌', '斓', '凌', '醋', '瑄', '嫘', '酪', '鲸', '酩', '禧', '蟀', '罨', '嘀', '鲨', '陵', '嘬', '酤', '溆', '躜', '膨', '濠', '耨', '攥', '跑', '露', '愫', '摔', '酚', '嘻', '缵', '楦', '嫡', '镝', '尊', '鞧', '浏', '阖', '醒', '摆', '蟛', '罩', '劓', '殴', '掷', '醉', '撰', '憾', '暄', '跪', '瘾', '趔', '融', '魑', '蘑', '酯', '礅', '漪', '殿', '魉', '萱', '嘚', '镉', '濞', '嗬', '黩', '瓒', '瞌', '檠', '澎', '璺', '黃', '撮', '儆', '懵', '匏', '渲', '髀', '攒', '棱', '溘', '漯', '鼓', '罽', '魔', '酡', '璐', '瘸', '鼾', '嘭', '豨', '薪', '祾', '潞', '幌', '髅', '乾', '撼', '膈', '猷', '絮', '萦', '耢', '彝', '谴', '耥', '縻', '醚', '鲩', '耀', '酮', '髂', '璇', '巍', '蔻', '鳌', '耠', '骺', '耧', '櫱', '蔬', '醺', '懑', '殛', '醇', '凝', '繁', '舔', '懂', '曙', '漩', '徽', '嬤', '嶷', '薇', '磕', '耪', '礴', '薯', '赣', '瞩', '警', '嗦', '殪', '瀚', '鲍', '酵', '醮', '灏', '嘱', '鲴', '颦', '鲼', '缱', '醌'];


export function generateRandomChinese(count: number): string {

  const chars = [];
  const visited = new Set<number>();

  while (chars.length < count) {
    const randomIndex = Math.floor(Math.random() * randomComplexCharacters.length);
    if (visited.has(randomIndex)) {
      continue;
    } else {
      chars.push(randomComplexCharacters[randomIndex]);
      visited.add(randomIndex);
    }
  }

  return chars.join(""); 
}